##==================##
##       Taps       ##
##==================##

# Core Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Command Extension Taps
tap "superatomic/bundle-extensions"

# Third-Party Taps
tap "coursier/formulas"
tap "heroku/brew"
tap "superatomic/xshe"

##==================##
##     Formulae     ##
##==================##

# Programming Languages
brew "python@3.8"
brew "python@3.10"
brew "ruby"
brew "coursier/formulas/coursier"
brew "vlang"

# Shells
brew "zsh"
brew "fish"
brew "elvish"

# Shell Additions
brew "starship"
brew "xshe"
brew "zsh-syntax-highlighting"
brew "fisher"
brew "thefuck"

# Command Line Tools
brew "bat"
brew "exa"
brew "micro"
brew "gh"
brew "git"
brew "poetry"
brew "ptpython"
brew "ffmpeg"
brew "imagemagick"
brew "tree"
brew "tldr"
brew "cmatrix"
brew "httpie"
brew "yt-dlp"
brew "neofetch"
brew "pup"
brew "jq"
brew "trash" # Note: macOS only!
brew "heroku/brew/heroku"

# Other Brews
brew "gnupg"
brew "pinentry-mac"
brew "openssl@3"
brew "portaudio"
brew "pv"
brew "sox"
brew "sphinx-doc"
brew "swig"

##==================##
##    Brew Casks    ##
##==================##

# Monospace Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"

# Character Fonts
cask "font-noto-emoji"

# QuickLook Extensions
cask "qlmarkdown", args: { no_quarantine: true, require_sha: true, appdir: "/Applications/Utilities/" }
cask "syntax-highlight", args: { no_quarantine: true, require_sha: true, appdir: "/Applications/Utilities/" }

# Utilities
cask "iterm2"
cask "eul", args: { appdir: "/Applications/Utilities/" }
cask "iina"
cask "balenaetcher"
cask "cakebrew"

# Image Manipulators
cask "gimp"
cask "inkscape"
cask "krita"

# Code Editors
cask "jetbrains-toolbox"
cask "vscodium", args: { no_quarantine: true, require_sha: true }

# Text Processing
cask "obsidian"
cask "typora"
cask "textmate"
cask "noto"

# Other Applications
cask "librewolf", args: { no_quarantine: true, require_sha: true }
cask "element"
cask "godot"
