
# Core Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Third-Party Taps
tap "heroku/brew"


# Programming Languages
brew "python@3.8"
brew "python@3.10"
brew "rust"
brew "ruby"

# Shell
brew "starship"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "fish"
brew "fisher"

# Command Line Tools
brew "bat"
brew "exa"
brew "micro"
brew "gh"
brew "git"
brew "ptpython"
brew "ffmpeg"
brew "imagemagick"
brew "tree"
brew "cmatrix"
brew "yt-dlp"
brew "neofetch"
brew "heroku/brew/heroku"

# Other brews
brew "gnupg"
brew "jansson"
brew "nghttp2"
brew "openssl@3"
brew "portaudio"
brew "pv"
brew "sox"
brew "sphinx-doc"
brew "swig"
brew "thefuck"
brew "nativefier"

# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Applications
cask "eul"
cask "iina"
cask "balenaetcher"
cask "iterm2"

cask "jetbrains-toolbox"
cask "visual-studio-code"

cask "gimp"
cask "krita"

cask "librewolf"
cask "element"

cask "obsidian"
cask "typora"
cask "textmate"

cask "unity"
cask "unity-hub"
cask "godot"
